#include "HBM32G003_iic.h"


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Init()
* 功能说明:	IIC初始化
* 输    入: IIC_TypeDef *IICx   IIC0
			uint16_t clk		IIC时钟
*			uint8_t IE_Enable	中断使能
* 输    出: 无
* 注意事项: 模块只能工作于主机模式
******************************************************************************************************************************************/
void IIC_Init(IIC_TypeDef *IICx,uint16_t clk,uint8_t IE_Enable)
{
	assert_param(IS_IIC_CLK(clk));                   //检查输入的参数clk是否合法    
	
	assert_param(IS_IIC_INT(IE_Enable));             //检查输入的参数IE_Enable是否合法    
	
	switch((uint32_t)IICx)
	{
		case ((uint32_t)IIC0):
			
			SYS->CLKEN |= 0x01 << SYS_CLKEN_IIC0_POS;    //开启IIC0时钟
		
		break;
	}
	
	IIC_Close(IICx);                                     //关闭IIC
	
	IICx->CLKDIV = SystemCoreClock/5000/clk - 1;         //配置IIC工作时钟
	
	if(IE_Enable)
	{
		IICx->CTRL |= (0x01 << IIC_CTRL_IE_POS);         //配置中断
	}
	else
	{
		IICx->CTRL &= ~(0x01 << IIC_CTRL_IE_POS);
	}
	
	if(IE_Enable)
	{
		switch((uint32_t)IICx)
		{
			case ((uint32_t)IIC0):
				
				NVIC_EnableIRQ(IIC0_IRQn);               //使能中断
			
			break;
		}
	}
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Open()
* 功能说明:	IIC打开，允许收发
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Open(IIC_TypeDef *IICx)
{
	IICx->CTRL |= (0x01 << IIC_CTRL_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Close()
* 功能说明:	IIC关闭，禁止收发
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Close(IIC_TypeDef *IICx)
{
	IICx->CTRL &= ~(0x01 << IIC_CTRL_EN_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start()
* 功能说明:	产生起始信号并发送设备地址
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t addr	    设备地址			
* 输    出: uint8_t			    1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Start(IIC_TypeDef *IICx,uint8_t addr)
{
	IICx->TXR = addr;       //从机地址
	IICx->CR = (0x01 << IIC_CR_START_POS) | (0x01 << IIC_CR_WR_POS);   //发送起始位和从机地址
	
	while(IICx->SR & IIC_SR_TIP_MSK) __NOP();		//等待发送完成
	return (IICx->SR & IIC_SR_RACK_MSK) ? 0 : 1;     //返回接收到的应答信号
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Stop()
* 功能说明:	产生停止信号
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Stop(IIC_TypeDef *IICx)
{
	IICx->CR = (0x01 << IIC_CR_STOP_POS);            //产生停止信号
	while(IICx->SR & IIC_SR_BUSY_MSK) __NOP();		//总线忙检测
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Write()
* 功能说明:	写入一个数据
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t data		要写的数据			
* 输    出: uint8_t				1 接收到ACK   0 接收到NACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Write(IIC_TypeDef *IICx,uint8_t data)
{	
	IICx->TXR = data;                                //待写入的数据
	IICx->CR = (0x01 << IIC_CR_WR_POS);              //写命令
	while(IICx->SR & IIC_SR_TIP_MSK) __NOP();		//等待发送完成
	return (IICx->SR & IIC_SR_RACK_MSK) ? 0 : 1;     //返回接收到的应答信号
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Read()
* 功能说明:	读取一个数据
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t ack			1 发送ACK   0 发送NACK			
* 输    出: uint8_t				读取到的数据
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Read(IIC_TypeDef *IICx,uint8_t ack)
{
	IICx->CR = (0x01 << IIC_CR_RD_POS) | ((ack ? 0 : 1) << IIC_CR_ACK_POS);              //读命令和反馈应答信号
	while(IICx->SR & IIC_SR_TIP_MSK) __NOP();		                                    //等待发送完成 
	return IICx->RXR;                            //返回读取到的数据            
}


/******************************************************************************************************************************************

以下几个函数是开启IIC中断后调用的函数

*******************************************************************************************************************************************/

/****************************************************************************************************************************************** 
* 函数名称:	IIC_Start_NoWait()
* 功能说明:	产生起始信号并发送设备地址
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t addr	  设备地址			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Start_NoWait(IIC_TypeDef *IICx,uint8_t addr)
{
	IICx->TXR = addr;       //从机地址
	IICx->CR = (0x01 << IIC_CR_START_POS) | (0x01 << IIC_CR_WR_POS);   //发送起始位和从机地址
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Write_NoWait()
* 功能说明:	写入一个数据
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t data			要写的数据			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Write_NoWait(IIC_TypeDef *IICx,uint8_t data)
{	
	IICx->TXR = data;                                //待写入的数据
	IICx->CR = (0x01 << IIC_CR_WR_POS);              //写命令
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Read_NoWait()
* 功能说明:	读取一个数据
* 输    入: IIC_TypeDef *IICx   IIC0
			uint8_t ack				1 发送ACK   0 发送NACK			
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_Read_NoWait(IIC_TypeDef *IICx,uint8_t ack)
{
	IICx->CR = (0x01 << IIC_CR_RD_POS) | ((ack ? 0 : 1) << IIC_CR_ACK_POS);              //读命令和反馈应答信号         
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_Wait_ACK()
* 功能说明:	读取应答信号
* 输    入: IIC_TypeDef *IICx   IIC0		
* 输    出:  0  NACK   1  ACK
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_Wait_ACK(IIC_TypeDef *IICx)
{
	if(IICx->SR & IIC_SR_RACK_MSK)
	{
		return 0;
	}
	else
	{
		return 1;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntEn()
* 功能说明: IIC中断使能
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntEn(IIC_TypeDef *IICx)
{	
	IICx->CTRL |= (0x01 << IIC_CTRL_IE_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntDis()
* 功能说明: IIC中断禁能
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntDis(IIC_TypeDef *IICx)
{	
	IICx->CTRL &= ~(0x01 << IIC_CTRL_IE_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntClr()
* 功能说明: IIC中断清除
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void IIC_IntClr(IIC_TypeDef *IICx)
{	
	IICx->CR = (0x01 << IIC_CR_IF_POS);
}


/****************************************************************************************************************************************** 
* 函数名称:	IIC_IntStat()
* 功能说明: IIC中断状态
* 输    入: IIC_TypeDef *IICx   IIC0
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t IIC_IntStat(IIC_TypeDef *IICx)
{	
	return (IICx->SR & IIC_SR_IF_MSK) ? 1 : 0;		
}


